{
    "autohide": true,
    "title": ["UPDATES","EXPERIMENTAL BUILD"],
    "current" : "0.3.7.0",
    "content" : [
        {
            "title" : "0.3.7.0",
            "timestamp" : 1417972809,
            "type" : "experimental",
            "content" : {
                "Bugfixes" : {"icon":"bug", "list":[
                    "Fixed random CTD on incorrect GPU buffer usage",
                    "Improved loading times by improving the collada 3d model loading times",
                    "Fixes unresponsive UI error message when idling in the menus for over 120 seconds",
                    "Partmanager fixed: gets rebuild when the vehicle is changed",
                    "When rotating vehicles, the debug mode is preserved now",
                    "Fixed vehicle colors affecting all other spawned vehicles. It is now possible to spawn two vehicles of the same type with different color."
                ]},
                "Vehicle Content" : {"icon":"car", "list":[
                    "new prop: large spinner",
                    "Fixed hamster wheel materials",
                    "Moonhawk pillar deformation improvements"
                ]},
                "Terrain Content" : {"icon":"world", "list":[
                    "Updated IND and GM with the new models from DRI that were recently improved."

                ]},
                "Features" : {"icon":"cog", "list":[
                    "Internationalization: Added Polish and French language basics. Should fit to the language you chose in steam. if steam is not running, it defaults to English."
                ]}
            }
        },
        {
            "title" : "0.3.6.9",
            "timestamp" : 1417424648,
            "type" : "experimental",
            "content" : {
                "Blogpost" : {"icon":"application_home", "text": "You can also read this update as blogpost in our blog:[br][ico=page_world] [url=http://www.beamng.com/entries/106-November-2014-Progress-report]November 2014: Progress report[/url]"},
                "Bugfixes" : {"icon":"bug", "list":[
                    "Sync with latest Torque3D upstream (lots of bugfixes, some minor new features)",
                    "more bugfixing on the new Scene Octree",
                    "fixed lots of memory problems, errors and potential crashes, as well as used, uninitialized variables that were found during static code analysis.",
                    "fixed bug #155 where objects rotation modified its scale: http://redmine.beamng.com/issues/155",
                    "Changed default decalBias for fix DecalRoads render too high over terrain.",
                    "3D roads now have collision",
                    "Fixed crash to desktop bug on async shader compilation",
                    "Fixed userpath usage: now the file is called 'userpath.ini' and works well with relative paths. (Also added examples to that file)",
                    "Fixed some bugs on the XInput manager, improved xinput cache file format, added some default known controllers",
                    "Lua FFB code now knows about the attached devices and can get the config",
                    "Fixed invalid normals on 3d mesh loading",
                    "Improved D3D9 fatal error messages: Now they produce a messagebox and show it to the user instead of the game failing in some undetermined way.",
                    "More work on Force feedback, nearly usable now :)",
                    "fixed simple gearbox app crashing the UI when no engine was installed",
                    "Loading screen loads first now, fixing the half-rendered loading screens",
                    "Fixed the new HTML part chooser",
                    "Fixed Bug 'Beamng enters infinite loop if .swp file is present in vehicle directory'",
                    "Fixed Bug #108 (http://redmine.beamng.com/issues/108): Restore driveshaft disabled status after user changes shifterMode.",
                    "Removed cleanup.bat script. Please delete your cache folder simply if you want to clean the cache.",
                    "Fixed Bug with red shifting in in grid map near big pipe",
                    "Fixed console spam when changing focus with FFB enabled",
                    "Fixed Input Test feature not working",
                    "Printing command line args to logfile as well for better crash reporting",
                    "New Vehicle Reset hook for UI apps",
                    "slighly fixed up main menu links width",
                    "Drivetrain: Fix for rotators and Optimizations."
                ]},
                "Vehicle Content" : {"icon":"car", "list":[
                    "minor changes to the hamster wheel",
                    "increased caster and SAI on hatch",
                    "Fixes to the cannon and angletester lua",
                    "New ramp prop, useful for loading things on the flatbed",
                    "Semi fueltanks: fix for improperly mirrored coltris",
                    "New prop; Metal Box, 100kg each",
                    "Hatch: work on toe out/in",
                    "Added a bit more power to stage 1 engine tuning on gavril v8s"
                ]},
                "Terrain Content" : {"icon":"world", "list":[
                    "HR: collisions working + terrain edits, new preview image",
                    "more textures added to HR + objects",
                    "Fixed water detail adjust for all maps except DRI",
                    "Added collision to a lot of the HR buildings + lod, minor improvements",
                    "Fixed material case names causing errors on GM, HR stuff, etc",
                    "improved the town base on eca",
                    "updated UI Winds app",
                    "Start bridge to HR, new lighting, start positions, checkered finish line, adjusted forest, road work, created checkpoints, terrain texture work, created new roadblock object"
                ]},
                "Features" : {"icon":"cog", "list":[
                    "Vehicle rotation basics working: We can now spawn the vehicles with any rotation. Some minor usability problems are to be fixed in the upcoming days.",
                    "64 Bit support basics added: We added support for 64 bit for Torque3D and it was quite soem work to get 64 bit support working well with all the libraries and the new Lua integration.",
                    "Added little launcher that will launch the 32 bits (x86) or 64 bits (x64) version, depending on the operating system. The real binaries are now in separate folders as this is the only possible workaround.",
                    "Added internationalization basics to the user interface. Not done at all yet, still WIP (needs to use the steam language if available)",
                    "Lua basics integrated into Torque3D. We slowly replace the integrated scripting language with Lua.",
                    "FMod re-integration tests (not published, for internal testing only)",
                    "OpenAL sound backend integrated",
                    "Joystick absolute axis support for spacemouse 3d support (also input map added for that)",
                    "Mouse Cursor hiding: It hides itself automatically now if no activity is detected for a certain amount of time. This function is disabled for some special cases (cefdev, mainmenu)",
                    "Triggers now work with the new T3D Lua",
                    "new Thrustmaster TX F458 wheel input mapping",
                    "The console now defaults to T3D Lua, also improved support for the other languages in there.",
                    "added Fanatec Base v2 input mapping basics",
                    "T3D Material selector defaulting to 100 materials per page, more materials per page possible now",
                    "Improved Wheel debug UI App"
                ]}
            }
        },
        {
            "title" : "0.3.6.7",
            "timestamp" : 1415703600,
            "type" : "experimental",
            "content" : {
                "Bugfixes" : {"icon":"bug", "list":[
                    "Fixed electrics not working.",
                    "Improved Force Feedback\n(disabled by default, not ready yet)",
                    "fixed simple gearbox app crashing the UI when no engine was installed in the vehicle"
                ]}
            }
        },
        {
            "title" : "0.3.6.6",
            "timestamp" : 1415658201,
            "type" : "experimental",
            "content" : {
                "Bugfixes" : {"icon":"bug", "list":[
                    "Fixed user interface randomly not working."
                ]}
            }
        },
        {
            "title" : "0.3.6.5",
            "timestamp" : 1415540775,
            "type" : "experimental",
            "content" : {
                "Blogpost" : {"icon":"application_home", "text": "You can also read this update as blogpost in our blog:[br][ico=page_world] [url=http://www.beamng.com/entries/105-Progress-report]Progress-report[/url]"},
                "Bugfixes" : {"icon":"bug", "list":[
                    "Fixed 360 controller zoom buttons sticking",
                    "Fixed occlusion handler for the headlights shining through under certain conditions",
                    "Fixed several memory issues with the game",
                    "Fixed combo box render bug within the UI, renders correctly now",
                    "Fixed laggy main menu: reverted to older CEF version to use the software-only rendering which is a lot faster and easier on the CPU/GPU",
                    "Fixed filesystem file change notifications: working recursively now, removing the need for empty directories inside the cache folder.",
                    "Fixed 'Parts Configuration' dialog from always popping up when hitting ctrl+r",
                    "Removed BeamNG watermark logo from the bottom left corner finally",
                    "re-encoded mainmenu videos to 720p for increased performance",
                    "Fixed bad video mode bug where the game's res could end up bigger than the current screen's resolution."
                ]},
                "Vehicle Content" : {"icon":"car", "list":[
                    "Fixed stretching parts on T75 when certain parts fell off",
                    "Textured D15 flatbed trailer",
                    "Lots of changes and fixes for T75 deformation",
                    "Other minor vehicle tweaks and fixes",
                    "Hamster wheel now detachable"
                ]},
                "Terrain Content" : {"icon":"world", "list":[
                    "Added tents and stadium lights to Hirochi Raceway",
                    "Added parking lot to HR",
                    "Added corner distance signs to HR",
                    "Improved roadside visuals for HR by adding in lined edging to suggest maintenance + road materials",
                    "Improved road barriers and rumble strips on HR (rumbles aren't so high anymore)",
                    "Improved the lighting on HR and ECA (the distance is more blue now, slight ambient changes as well)",
                    "Improved terrain and grass colors for HR",
                    "More work on the details of HR (more forest, decals, etc), improvements and texture additions",
                    "Minor adjustments and additions to ECA",
                    "Fixed a heightmap issue on ECA (there was a sharp pyramid sticking out of the road)",
                    "Removed duplicate car on Small Island (it was sitting in the ocean)"
                ]},
                "Features" : {"icon":"cog", "list":[
                    "new startup screen",
                    "Force Feedback basics, not working out of the box yet, might damage your hardware, [ico=exclamation][b]try on your own risk[/b]. FF is currently always on for the first wheel and it might be inverted depending on your hardware.",
                    "Asynchronous shader compilation: reducing lag/halts when playing, funky material loading at startup now but reducing the loading times significantly",
                    "FPS limiter: Max FPS is currently hardcoded to 60 to allow a smoother gameplay experience, will be set-able later on.",
                    "Improve speed of generation for grass and other small objects when camera are moving: this fixes the microlag that occurs when driving fast.",
                    "New HTML GUI for options/settings (supports live changes) (WIP)",
                    "New CTRL + Space vehicle selector with filters and factory colors",
                    "Force Feedback Debug app: we wrote some helper applications that display the steering wheel position vs the applied force feedback",
                    "Lua integration into Torque3D for simpler controller binding workflow (just started with it, WIP)"
                ]},
                "Known Problems" : {"icon":"exclamation", "list":[
                    "Parts Chooser is completely broken as we are in the transition phase from the old version that uses the legacy T3D GUI towards the new HTML version.",
                    "Input Tester is broken"
                ]}
            }
        },
        {
            "title" : "0.3.6.3",
            "timestamp" : 1412005730,
            "type" : "experimental",
            "content" : {
                "Bugfixes" : {"icon":"bug", "list":[
                    "Fixed camera rotation not working (issue [url=http://redmine.beamng.com/issues/175] [ico=bug_link]175[/url])",
                    "Fixed CTD (Crash To Desktop) on GUI editor (F10) when exiting the game",
                    "Split Lua subsystem into a sync and async part to speed up the game"
                ]},
                "Content" : {"icon":"car", "list":[
                    "Added Cannon"
                ]},
                "Features" : {"icon":"cog", "list":[
                    "Added Bootup logo and fading"
                ]}
            }
        },
        {
            "title" : "News",
            "content" : "[i]Hey, welcome to this news box! [ico=emoticon_smile][/i]\nWe will keep you informed about things in here from now on."
        },
        {
            "title" : "0.3.6.2",
            "timestamp" : 1411865859,
            "type" : "experimental",
            "content" : {
                "Bugfixes" : {"icon":"bug", "list":[
                    "General performance improvements",
                    "[b]User Interface performance improvements[/b]: fixed several bugs in combination with new CEF version and using GPU accelerated drawing now",
                    "Tacho will now display either Auto or manual depending on current shift mode",
                    "Fix for issue [url=http://redmine.beamng.com/issues/159] [ico=bug_link]159[/url]: D15 small trailer 0 size beams",
                    "Fixed CTD (Crash to Desktop) on missing background fallback image",
                    "[b]Improved Speed of the water reflection[/b]: only updating once per frame now.",
                    "Removed Lua performance tracking to improve performance",
                    "Removed banabench for now until we fixed the filesystem up again"
                ]},
                "Content" : {"icon":"car", "list":[
                    "[b]Revised Main menu[/b]: Improved notification area and added updates info box",
                    "[b]East Coast[/b]: mostly minor fixes (improved water objects visuals)",
                    "[b]Hirochi Raceway[/b]: more vegetation placed, some areas cleaned up (better road blending etc), updated signs",
                    "[b]Fixed strange wind issues[/b] on some trees on official maps (community maps will need to be fixed by their authors)",
                    "[b]Fixed collision mesh[/b] of ramp 2 on gridmap",
                    "[b]Now shipping temporary files within the levels[/b] for faster loading"
                ]}
            }
        },
        {
            "title" : "0.3.6.1",
            "timestamp" : 1411690398,
            "type" : "experimental",
            "content" : {
                "Bugfixes" : {"icon":"bug", "list":[
                    "Collisions with heavy objects are a lot more stable now",
                    "Rebalanced friction calculations, slightly differently now",
                    "Cull individual forest item for improved performance of render shadow pass (saves some ms per frame)",
                    "Fixed vibrations when changing simulation speed to slow motion",
                    "Fixed UI hiding: should hide properly now",
                    "Fixed lua split() discarding string parts (be sure to check if your lua script now behaves differently)",
                    "Fixed file system notifiers taking too much time: faster startup",
                    "Increased precision on ui update rate"
                ]},
                "Content" : {"icon":"car", "list":[
                    "Hirochi raceway has collision again",
                    "More work on Hirochy raceway: barriers, forest, added undergrowth, road and vegetation work, updated signs, texture work",
                    "Sunburst: improvements on the suspension, added simple traction control, improved fuel tank and windshield wipers, cvt ratios, increased turbo power, tuning the driving characteristics",
                    "Tire stabilization improvements on some vehicles",
                    "Fixed hamster wheel ramp and large tilt base having no collision",
                    "Reduced shakiness of large crusher (also removed duplicate example crusher)",
                    "T75: fixes on the engine and the radiator, improving stability a lot when crashing the front",
                    "Less torsional frame rigidity for pickup and van",
                    "Tuned shift points for some vehicles",
                    "Added cubemap to smallgrid (vehicles now have reflections)",
                    "Added vehicle thumbnails for new vehicle selector (press Space)",
                    "Parkingbrake hydros added to h45 cargo box",
                    "Improved collision mesh for the industrial bridges to prevent tire catching when breaking or sliding",
                    "Corrected some path issues for the rock material on gridmap",
                    "Bolide collision fixes"
                ]},
                "Features" : {"icon":"cog", "list":[
                    "LuaSocket is now completely integrated and always enabled. It has a security sandbox and can only connect to localhost and private IPv4 addresses (the previous command line switch is now obsolete)",
                    "The ingame UI now uses local:// instead of file://. That enables it to use the virtual filesystem and i.e. load preview images from inside zips. There might be some stuttering in the main menu which we are working on. (This was a huge undertaking to get working well)"
                ]}
            }
        }
    ]
}
